/* 个人贷款常量配置 */
// 审批进度
export const APPROVAL_TYPE = {
  1010: '待审批',
  1020: '审批中',
  1030: '退回补充资料',
  1040: '批准',
  1050: '否决'
}

// 业务品种
export const LOANS_TYPE = {
  1110: '个人业务',
  1110010: '个人住房贷款',
  1110020: '个人商业用房贷款',
  1110030: '个人消费汽车贷款',
  1110040: '个人商用汽车贷款',
  1110050: '个人住房装修贷款',
  1110060: '个人购置耐用消费品',
  1110070: '薪金贷',
  1110080: '个人质押贷款',
  1110090: '个人委托贷款',
  1110100: '个人经营周转贷款',
  1110110: '个人经营周转贷款（微）',
  1110120: '个人接续社会保险小额贷款',
  1110130: '下岗再就业贷款（个人）',
  1110150: '个人住房公积金贷款',
  1110160: '个人综合消费贷款',
  1110170: 'POS贷',
  1110180: '薪金贷（网贷）',
  1110190: '个人出国金融贷款',
  1110210: '连连贷（个人）',
  1110220: '个人账户透支贷款'
}

// 借据状态类型
export const IOU_TYPE = {
  0: '正常',
  1: '逾期',
  2: '正常结清',
  3: '提前结清',
  4: '逾期结清',
  5: '已全部核销',
  6: '已冲销',
  7: '卖断结清',
  8: '卖出待回购',
  9: '卖出代保管'
}

// 还款方式类型
export const RPT_TYPE = {
  'RPT16': '等额本金',
  'RPT01': '分期付息到期还本',
  'RPT23': '按周期付息按周期还本',
  'RPT05': '利随本清',
  'RPT17': '等额本息',
  'RPT20': '不规则还款'
}

// 币种
export const CRY_TYPE = {
  156: '人民币'
}

// 发生方式
export const H_TYPE = {
  '1': '新发生',
  '6': '展期',
  '3': '借新还旧',
  '4': '资产重组',
  '5': '资产买入',
  '99': '回购',
  '2': '收回再贷'
}

// 利率类型
export const RAT_TYPE = {
  'RAT001': '贷款浮动利率',
  'RAT002': '贷款固定利率',
  'RAT010': '分段利率'
}

/* 我的账户常量配置 */
// 交易渠道
export const TRAN_TYPE = {
  'CBS': '社区银行',
  'DBS': '直销银行',
  'SCBS': '社区银行服务',
  'MER': '商城',
  'S0T0': '020商户服务',
  'AJB': '蚂蚁借呗',
  'AUT': '自主终端',
  'BUS': '公交IC充值',
  'FUD': '电信诈骗',
  'GTZ': '柜台债',
  'IBS': '国结',
  'IIP': '智能收款渠道',
  'NYY': '电子验印',
  'PBS': '公安查控系统',
  'PLN': '微粒贷',
  'PSC': '公安贷款渠道',
  'SBK': '线上社保卡渠道',
  'STM': '超级柜员机智能网点',
  'SV0': '监察机关渠道',
  'UNC': '银联无卡快捷支付',
  'YHT': '银户通',
  'ZBL': '财政零余额',
  'ZZL': '中债直连渠道',
  'NET': '网上银行',
  'TEL': '电话银行',
  'MBS': '手机银行',
  'ATU': '自助银行终端',
  'ATM': 'ATM',
  'CNT': '柜面',
  'CUT': '法院',
  'DBK': '平安直销银行',
  'MKT': '移动营销',
  'PAY': '支付网关',
  'BSP': '票据系统',
  'DBS': '直销银行',
  'POS': 'POS终端渠道',
  'WEB': '洛阳银行网站',
  'BCD': '银企直联',
  'MIC': '微信银行',
  'WCC': '微信渠道',
  'SZS': '深圳金融估算系统',
  'CUP': '中国银联',
  'OTH': '其他渠道',
  'BCC': '城市商业银行',
  'SYS': '后台记账使用',
  'NUC': '网联',
  '000': '渠道无关',
  '999': '全部',
  '990': '交易批量',
  '992': '会计批量',
  '998': '非柜面渠道',
  '014': '质押贷',
  '013': '信贷系统',
  '012': '会计系统',
  '011': '国际业务系统',
  '800': '核心系统'
}

// 转账类型
export const TS_TYPE = {
  'TR': '转账付款',
  'QR': '二维码转账',
  'MB': '手机号转账',
  'AA': 'AA付款',
  'GROUP_COLL': '集团归集',
  'BC': '批量',
  'WAGE': '代发',
  'BT': '预借',
  'RT': '报销',
  'GD': '下拨',
  'GU': '上划'
}
